app/controllers/urls_controller.rb

SELECT  "urls".* FROM "urls" WHERE "urls"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @shortened_url = Url.find(params[:id])