app/controllers/urls_controller.rb

SELECT "animals"."animal" FROM "animals"  ORDER BY RANDOM()
SELECT "adjectives"."adjective" FROM "adjectives" WHERE "adjectives"."kind" = $1  ORDER BY RANDOM()  [["kind", "positive"]]
SELECT "urls".* FROM "urls" WHERE "urls"."animurl" = $1  [["animurl", "AdaptableAggressiveOtter"]]
INSERT INTO "urls" ("animurl", "url", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["animurl", "AdaptableAggressiveOtter"], ["url", "{\"url\"=>\"http://peterli.io\"}"], ["created_at", "2015-04-15 17:26:40.222813"], ["updated_at", "2015-04-15 17:26:40.222813"]]
---
  def create
    @counter = 0
    @limit = 10 #378378 total possibilities -> 99 * 98 * 39

    loop do
      @animal = Animal.order("RANDOM()").pluck("animal").first
      @pos_adj = Adjective.where(:kind => "positive").order("RANDOM()").pluck("adjective").first
      @neg_adj = Adjective.where(:kind => "negative").order("RANDOM()").pluck("adjective").first

      @animurl = @pos_adj.to_s + @neg_adj.to_s + @animal

      if (Url.where(:animurl => @animurl).blank?)
        break
      elsif (@counter > @limit)
        render :action => "new"
      end

      @counter += 1
    end

    @url = params[:url][:url]

    if (@url.index("http://") == nil && @url.index("https://") == nil && @url != "")
      @url = "http://" + @url
    end

    @shortened_url = Url.new(:url => @url, :animurl => @animurl)
    if @shortened_url.save

SELECT  "urls".* FROM "urls" WHERE "urls"."animurl" = $1  ORDER BY "urls"."id" ASC LIMIT 1  [["animurl", "AdaptableAggressiveOtter"]]
---
  def show
    @shortened_url = Url.where(:animurl => params[:id]).first